{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "hallo",
        "hai",
        "hei",
        "Hi",
        "hi",
        "hi, apa yang bisa saya bantu",
        "Hi apa kabar",
        "start",
        "apa kabar",
        "hy",
        "pagi",
        "morning",
        "siang",
        "afternoon",
        "sore",
        "malam"
      ],
      "responses": [
        "Hi, Apa ada yang bisa saya bantu",
        "Hai, adakah yang perlu saya bantu"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Dah",
        "Dadah",
        "see u",
        "bye",
        "selamat tinggal",
        "see u next time",
        "bye bye",
        "See you"
      ],
      "responses": [
        "Bye!",
        "Dadahh!",
        "Good bye!",
        "semoga hari harimu menyenangkan",
        "sehat sehat terus ya",
        "Semoga happy terus"
      ]
    },
    {
      "tag": "terimakasih",
      "patterns": [
        "Thanks a lot",
        "Thank you",
        "makasih banyak",
        "Makasih banget",
        "Terima kasih"
      ],
      "responses": ["tentu saja:)", "You are welcome", "sama sama", "of course"]
    },
    {
      "tag": "Jadwal Bengkel",
      "patterns": [
        "Apakah Bengkel buka setiap hari atau ada hari libur tertentu"
      ],
      "responses": [
        "Baik, mengenai jam operasional bengkel yamaha kami buka Senin-Jum'at"
      ]
    },
    {
      "tag": "Sparepart",
      "patterns": [
        "Apa saja jenis spare part asli yang tersedia di bengkel Yamaha?"
      ],
      "responses": [
        "Baik, Jenis-jenis spare part asli Yamaha yang tersedia di bengkel kami meliputi,Filter udara dan oli,Busi Karburator, Rantai, sepeda, motorKabel, gasRem, (cakram dan tromol) ,Oli mesin, Kopling, Gasket Aki"
      ]
    },
    {
      "tag": "layanan Service",
      "patterns": [
        "Apakah bengkel Yamaha memberikan jaminan atau garansi untuk layanan servis yang mereka berikan?"
      ],
      "responses": [
        "Ya, kami memberikan jaminan atau garansi untuk layanan servis yang kami berikan. Garansi ini meliputi kualitas kerja dan suku cadang yang kami gunakan selama periode tertentu, biasanya tergantung pada jenis layanan yang Anda pilih. Apakah ada lagi pertanyaan?"
      ]
    },
    {
      "tag": "Informasi Layanan",
      "patterns": [
        "kaca spion motor saya sudah rusak, apa yang harus saya lakukan?"
      ],
      "responses": [
        "anda dapat melakukan service ringan, biasanya membutuhkan waktu 45 menit atau lebih untuk perbaikan dan pergantian suku cadang. Semoga membantu!"
      ]
    },
    {
      "tag": "Jam buka - tutup bengkel",
      "patterns": ["kapan bengkel yamaha buka? "],
      "responses": ["buka setiap hari dari jam 08.00 sampai 17.00."]
    },
    {
      "tag": "Ban motor",
      "patterns": ["kapan ban motor harus diganti?"],
      "responses": [
        "rata-rata memiliki usia pakai 3-4 tahun dengan pemakaian standar dimana setiap hari dipakai untuk kerja berangkat dan pulang saja. Namun, jika dipakai untuk operasional seharian penuh seperti pada kurir antar barang maka ketahanan usia ban motor hanya 2-3 tahun."
      ]
    },
    {
      "tag": "Oli Motor",
      "patterns": ["waktu yang tepat untuk mengganti oli motor matic"],
      "responses": [
        "Waktu ideal ganti oli motor matic motor yamaha itu  sama saja, dihitung berdasarkan jarak tempuh. Idealnya motor matic yamaha sebaiknya melakukan pergantian oli sebelum jarak tempuh mencapai 3.000 km."
      ]
    },
    {
      "tag": "Bensin",
      "patterns": ["motor yamaha NMAX sebaiknya diisi bensin apa?"],
      "responses": [
        "Yamaha NMAX memiliki rasio kompresi 10,5 : 1. Bahan bakar yang cocok dengan Yamaha NMAX yaitu bensin Pertamax."
      ]
    },
    {
      "tag": "Ukuran Piston",
      "patterns": ["Berapa ukuran piston Nmax 155 Old ?"],
      "responses": [
        "ukuran piston Nmax old Berukuran 58 mm dengan langkah 58,7 dan mendapatkan angka 155 cc"
      ]
    },
    {
      "tag": "Circuit",
      "patterns": [
        "Bagaimana motor mio bisa membalap motor nmax di circuit sentul?"
      ],
      "responses": ["Sebaiknya tidak dilakukan yah"]
    },
    {
      "tag": "Bengbot",
      "patterns": ["Apa sih Bengbot itu?", "Siapa sih Bengbot?"],
      "responses": [
        "Bengbot adalah chatbot yang siap membantu Anda dalam menjawab pertanyaan dan memberikan informasi tentang layanan kami di bengkel motor."
      ]
    },
    {
      "tag": "layanan Service",
      "patterns":["apakah bisa servis cvt"],
      "responses":["bisa, tapi di kenakan biaya tergantung jenis dan cc motornya"]
    },
    {
      "tag": "bore up",
      "patterns":["Apakah kompresi motor bisa di bore up?"],
      "responses":[
        "Disarankan melakukan bore up dengan ukuran yang sesuai dengan standar. apabila melampaui ukuran maka akan menyebabkan menghambat pelepasan panas di mesin"
      ]
    },
    {
      "tag": "ganti shock",
      "patterns":["berikan saya tips supaya ga sering ganti shock"],
      "responses":[
        "tidak membawa beban yang melebihi beban kapasitas yang disarankan dari motor itu sendiri, karena beban itu berpengaruh dengan keawetan shock breaker itu sendiri"
      ]
    },
    {
      "tag": "Oli Motor",
      "patterns":["oli yamalube super sport untuk jenis motor apa?"],
      "responses":[
        "diformulasikan khusus untuk perawatan mesin motor 4-Tak modern tipe sport yang mana mempunyai kerapatan mesin yang kecil, material komponen yang lebih baik dan tenaga mesin yang besar"
      ]
    },
    {
      "tag":"Harga Oli",
      "patterns":["berapa harga oli yamalube sport"],
      "responses":["38.000/liter"]
    },
    {
      "tag":"Oli Motor",
      "patterns":["oli apa yang cocok untuk yamaha NMAX?"],
      "responses":[
        "cocok dengan oli Motul GP Matic 10W 40, Yamahalube Super Matic, Petroasia Revol Matic SAE 10W40 API SL, PTT Lubricants Challenger Scooter SAE 10W30, Shell Matic Ulyra dan masih banyak pilihan lagi"
      ]
    },
    {
      "tag": "Kampas kopling",
      "patterns":["Berapa lama umumnya kampas kopling sepeda motor Honda dapat bertahan sebelum perlu diganti?"],
      "responses":[
        "Umur pakai kampas kopling dapat bervariasi tergantung pada gaya berkendara, kondisi jalan, dan pemeliharaan yang dilakukan, tetapi umumnya, kampas kopling biasanya perlu diganti setiap beberapa puluhan ribu kilometer"
      ]
    },
    {
      "tag": "Filter Oli",
      "patterns":["Kenapa filter oli harus di ganti?"],
      "responses":[
        "filter oli sebaiknya diganti setiap kali melakukan pergantian oli mesin, biasanya berkisar antara 5.000 hingga 10.000 kilometer tergantung pada kondisi penggunaan dan rekomendasi pabrikan"
      ]
    },
    {
      "tag": "Cakram motor",
      "patterns":["Apa tandanya cakram motor perlu di ganti?"],
      "responses":["adanya goresan atau retak pada permukaan cakram atau gejala pengereman tidak efektif bahkan setelah dilakukan perawatan"]
    },
    {
      "tag": "Stang motor" ,
      "patterns":["Sebutkan variasi stang motor yang tersedia"],
      "responses":[
        "Ya, terdapat berbagai macam variasi stang motor yang tersedia di pasaran, termasuk stang dengan bentuk, tinggi, lebar, atau material yang berbeda, sesuai dengan kebutuhan dan preferensi pengendara"
      ]
    },
    {
      "tag": "Ganti leher motor" ,
      "patterns":["berapa harga ganti leher motor atau bearing?"],
      "responses":["harga sekitar 30k-100k"]
    },
    {
      "tag": "Oli Motor" ,
      "patterns":["mengapa motor yamaha boros oli?"],
      "responses":["karena produk yamaha cenderung mengalami penguapan lebih banyak ketimbang pesaing"]
    }
  ]
}
